In [1]:
%pylab inline
import pandas as pd

Populating the interactive namespace from numpy and matplotlib

In [2]:
df = pd.DataFrame({'AAA': [1,2,3,4,5,6], 'BBB': [10,20,30,40,50,60], 'CCC':[9,8,7,6,5,4]})

In [3]:
df['AAA']

0    1
1    2
2    3
3    4
4    5
5    6
Name: AAA, dtype: int64

In [4]:
df['AAA'] * df['CCC']

0     9
1    16
2    21
3    24
4    25
5    24
dtype: int64

In [5]:
del df['BBB']

In [6]:
df

   AAA  CCC
0    1    9
1    2    8
2    3    7
3    4    6
4    5    5
5    6    4

In [7]:
tmpvar = df.pop('CCC')

In [8]:
tmpvar * 23

0    207
1    184
2    161
3    138
4    115
5     92
Name: CCC, dtype: int64

In [9]:
df

   AAA
0    1
1    2
2    3
3    4
4    5
5    6

In [10]:
df['DDD']=['A','B','C','D','E','F']

In [11]:
df

   AAA DDD
0    1   A
1    2   B
2    3   C
3    4   D
4    5   E
5    6   F

In [12]:
liste = [45,56,45,34,23,12]
df.insert(1,'mellemcol', liste)

In [13]:
df

   AAA  mellemcol DDD
0    1         45   A
1    2         56   B
2    3         45   C
3    4         34   D
4    5         23   E
5    6         12   F

In [14]:
df2 = pd.DataFrame({'Acol': ['A','B','C','B'], 'Bcol':['C','D','B','A']})

In [15]:
df2

  Acol Bcol
0    A    C
1    B    D
2    C    B
3    B    A

In [16]:
df2['Acol']

0    A
1    B
2    C
3    B
Name: Acol, dtype: object

In [17]:
df2[['Acol', 'Bcol']]

  Acol Bcol
0    A    C
1    B    D
2    C    B
3    B    A

In [18]:
df2.iloc[2] # række 3 nul-index

Acol    C
Bcol    B
Name: 2, dtype: object

In [19]:
df2.iloc[0:2]

  Acol Bcol
0    A    C
1    B    D

In [20]:
df2.iloc[:-1] #alt pånær den sidste række

  Acol Bcol
0    A    C
1    B    D
2    C    B

In [21]:
df2+df2.iloc[0] #første række satsammen med alt i matrix

  Acol Bcol
0   AA   CC
1   BA   DC
2   CA   BC
3   BA   AC

# Overskrivning af begge dataframes

In [22]:
df = pd.DataFrame(np.random.rand(10,4), columns=['A','B','C','D']) # 10  rækker 4 kolonner med tal
df2 = pd.DataFrame(np.random.rand(7,3), columns=['A','B','C']) #7 rækker 3 kolonner med tal
sumdf= df + df2 # de rækker der mangler kan ikke summes derfor NaN

In [23]:
sumdf

          A         B         C   D
0  0.866855  0.136640  1.882335 NaN
1  0.115175  1.033715  0.600359 NaN
2  1.216548  1.849002  1.227765 NaN
3  1.089640  0.539965  0.407014 NaN
4  0.347249  1.635574  0.450495 NaN
5  0.762085  1.746572  1.005875 NaN
6  0.805766  0.828569  0.861812 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [24]:
sumdf>0.7 # sandfalsk maske

       A      B      C      D
0   True  False   True  False
1  False   True  False  False
2   True   True   True  False
3   True  False  False  False
4  False   True  False  False
5   True   True   True  False
6   True   True   True  False
7  False  False  False  False
8  False  False  False  False
9  False  False  False  False

In [25]:
sumdf[sumdf>0.7] #data udtræk med sandfalsk maske

          A         B         C   D
0  0.866855       NaN  1.882335 NaN
1       NaN  1.033715       NaN NaN
2  1.216548  1.849002  1.227765 NaN
3  1.089640       NaN       NaN NaN
4       NaN  1.635574       NaN NaN
5  0.762085  1.746572  1.005875 NaN
6  0.805766  0.828569  0.861812 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [26]:
colBdata = sumdf['B']>0.7 #udtræk på kolonne med maske

In [27]:
colBdata

0    False
1     True
2     True
3    False
4     True
5     True
6     True
7    False
8    False
9    False
Name: B, dtype: bool

In [28]:
sumdf[colBdata] # bemærk kolonne index, kun de kolonner med true er taget med, med denne metode kan vi fjerne rækker

          A         B         C   D
1  0.115175  1.033715  0.600359 NaN
2  1.216548  1.849002  1.227765 NaN
4  0.347249  1.635574  0.450495 NaN
5  0.762085  1.746572  1.005875 NaN
6  0.805766  0.828569  0.861812 NaN

# overskrivning af df

In [29]:
df2 = pd.DataFrame({'Acol': ['A','B','C','B'], 'Bcol':['C','D','B','A']})

In [30]:
df2.isin(['A']) # gennemse hele dataframen og tjek om indholdet fra listen findes

    Acol   Bcol
0   True  False
1  False  False
2  False  False
3  False   True

In [31]:
df2.isin(['A','D']) # gennemse hele dataframen og tjek om indholdet fra listen findes

    Acol   Bcol
0   True  False
1  False   True
2  False  False
3  False   True

In [32]:
df2.where(df2 > 'B' ) # gode gamle SQL

  Acol Bcol
0  NaN    C
1  NaN    D
2    C  NaN
3  NaN  NaN

In [33]:
filter1 = df2['Acol'] > 'A'
filter2 = df2['Bcol'] < 'D'

In [34]:
df3 = df2.where(filter1 & filter2)
df3

  Acol Bcol
0  NaN  NaN
1  NaN  NaN
2    C    B
3    B    A

In [35]:
df4 = df3.isnull()
df4

    Acol   Bcol
0   True   True
1   True   True
2  False  False
3  False  False

In [36]:
maske = ~df4 #flip the bool, maske der fjerne NaN
maske

    Acol   Bcol
0  False  False
1  False  False
2   True   True
3   True   True

In [37]:
df3

  Acol Bcol
0  NaN  NaN
1  NaN  NaN
2    C    B
3    B    A

In [39]:
df3.dropna() # eller bare brug den metoder der allerede er lavet

  Acol Bcol
2    C    B
3    B    A

In [40]:
df3 = df2.where(filter1 & filter2)

In [41]:
df3

  Acol Bcol
0  NaN  NaN
1  NaN  NaN
2    C    B
3    B    A

In [42]:
df3.fillna('popo') #erstat NaN

   Acol  Bcol
0  popo  popo
1  popo  popo
2     C     B
3     B     A